clusterMHDTest/MHD-vortex/RK-CFL08/HLLC-L/0/B
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      B;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0.5 -0.5 -1 0 0 0 0];

internalField   nonuniform List<vector> 
40000
(
(0.0157073173 0.0314107591 0)
(0.0471064507 0.0314107591 0)
(0.0784590957 0.0314107591 0)
(0.109734311 0.0314107591 0)
(0.140901232 0.0314107591 0)
(0.1719291 0.0314107591 0)
(0.202787295 0.0314107591 0)
(0.233445364 0.0314107591 0)
...
)
;

boundaryField
{
    front-back
    {
        type            empty;
    }
    periodic_half0
    {
        type            cyclic;
    }
    periodic_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
