clusterMHDTest/MHD-vortex/RK-CFL08/HLLC-L/0/Bx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Bx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -2 0 0 -1 0];

internalField   nonuniform List<scalar> 
40000
(
0.0157073
0.0471065
0.0784591
0.109734
0.140901
0.171929
0.202787
0.233445
...
)
;

boundaryField
{
    front-back
    {
        type            empty;
    }
    periodic_half0
    {
        type            cyclic;
    }
    periodic_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
