clusterMHDTest/MHD-vortex/RK-CFL08/HLLC-L/0/Ma
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ma;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
40000
(
0.0222135
0.0496562
0.0800159
0.110852
0.141774
0.172645
0.203394
0.233973
...
)
;

boundaryField
{
    front-back
    {
        type            empty;
    }
    periodic_half0
    {
        type            cyclic;
    }
    periodic_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
