clusterMHDTest/MHD-vortex/RK-CFL08/HLLC-L/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


3
(
front-back
{
    type            empty;
    nFaces          80000;
    startFace       79600;
}

periodic_half0
{
    type            cyclic;
    nFaces          400;
    startFace       159600;
    neighbourPatch  periodic_half1;
}

periodic_half1
{
    type            cyclic;
    nFaces          400;
    startFace       160000;
    neighbourPatch  periodic_half0;
}

)


// ************************************************************************* //
